Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserType
The filter expression parser type defines the filter expression parser.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserType.TEKLA
The Tekla Structures filter expression.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionParserType.C
The C language filter expression (to be used only for test purposes).